<A name = 0>
<html>
<head> 
<TITLE>X.500 RCCN - Como participar</TITLE>
</head>
<P>
<IMG SRC="../../0/0/23.gif" > <P>Este documento faz parte do <A HREF="../../0/0/7.htm" 
>servidor WWW do Servi&ccedil;o X.500 </A>da RCCN
 
</hr>

<body>
<h1> 
Participa&ccedil;&atilde;o no servi&ccedil;o X.500 da RCCN</h1>

<p>

<h2> Perfil de Participa&ccedil;&atilde;o </h2>

As organiza&ccedil;&otilde;es (acad&eacute;micas ou n&atilde;o) podem participar no  projecto piloto
de v&aacute;rias maneiras:
 
   <ul>
  <li>Instala&ccedil;&atilde;o de DSA/DUA pr&oacute;prio
  <li>Instala&ccedil;&atilde;o dum DUA pr&oacute;prio e coloca&ccedil;&atilde;o da informa&ccedil;&atilde;o
        num dos DSAs de backbone da RCCN
   <li>Utiliza&ccedil;&atilde;o de DUAs de acesso p&uacute;blico e coloca&ccedil;&atilde;o 
         da informa&ccedil;&atilde;o num DSA de backbone da RCCN
    <li>Utiliza&ccedil;&atilde;o de DUAs de acesso p&uacute;blico
   </ul>

 <p>

 <h2> DUA de acesso p&uacute;blico </h2> 

 Existe presentemente um <A HREF="../../dium.htm">DUA de acesso p&uacute;blico.</A> O acesso &eacute; conseguido

<p>

  <ul>
   <li>Por telnet, para o host dsa.fccn.pt (endere&ccedil;o IP 193.136.5.1)
   <li> Por pad, para o endere&ccedil;o 02301031425 (TELEPAC) ou
          20436840001025    (EMPB).
    </ul>

 Utilizando o login   dua acede-se a um menu onde &eacute; dada a op&ccedil;&atilde;o de escolha entre diversos DUAs.
   
<p> 

  <h2>DUA pr&oacute;prio </h2>

  Para instalar um DUA pr&oacute;prio &eacute; necess&aacute;rio  que a organiza&ccedil;&atilde;o tenha conectividade IP nacional num MacIntosh com MacTCP, num PC MS-DOS com o software FTP ou ainda uma m&aacute;quina Unix.

<p>

  &Eacute; tamb&eacute;m poss&iacute;vel manter um DUA pr&oacute;prio possuindo os requisitos
   hardware e software para instalar o  <A HREF="../../dium.htm" >ISODE (ISO Development Environment)</A>
    tendo conectividade IP nacional ou acesso s&iacute;ncrono &agrave; Rede P&uacute;blica
 de Dados (TELEPAC).

<p>

  <h2> Coloca&ccedil;&atilde;o de informa&ccedil;&atilde;o em DSAs de backbone </h2>

Para colocar informa&ccedil;&atilde;o num DSA de backbone &eacute; necess&aacute;rio que exista 
 na  organiza&ccedil;&atilde;o um   gestor de dados que se responsabilize pela
 sua manuten&ccedil;&atilde;o.

<p>

 Procedimento a realizar
 
  <ul>
  <li>Contacto com o gestor do DSA Master PT para cria&ccedil;&atilde;o da organiza&ccedil;&atilde;o e da
        entrada para o gestor de dados
  <li>Coloca&ccedil;&atilde;o, usando o DUA DM de acesso p&uacute;blico da informa&ccedil;&atilde;o
        recolhida na respectiva organiza&ccedil;&atilde;o
  <li>Manuten&ccedil;&atilde;o da informa&ccedil;&atilde;o utilizando o DM
 </ul>

  Os DSAs de backbone s&oacute; mant&ecirc;m informa&ccedil;&atilde;o sobre organiza&ccedil;&otilde;es com um
  n&uacute;mero limitado de entradas (menos de 100). As organiza&ccedil;&otilde;es que ultrapassem esse limite devem instalar o seu pr&oacute;prio DSA.
  
<p>

 <h2> DUA/DSA pr&oacute;prios  </h2>

Para que uma organiza&ccedil;&atilde;o possa manter a sua informa&ccedil;&atilde;o num DSA pr&oacute;prio &eacute;
 necess&aacute;rio:
 <ul>
  <li>Dispor de conectividade IP nacional ou acesso s&iacute;ncrono
        &agrave; Telepac
  <li>Dispor duma m&aacute;quina Unix que suporte o <A HREF="../../dium.htm" >ISODE 8.0</A>
  <li>Instalar o ISODE 8.0 e o QUIPU
   <li>Contactar o gestor do DSA master PT para registo da sua Organiza&ccedil;&atilde;o 
     e   DSA e,
   <li>Ligar-se &agrave; Directoria Global.
   </ul>
  
<p>

<ADDRESS>
<hr>
<A HREF="../../dium.htm">www</A>
<!%%DateLastModified>Page last modified:Fri Jul 22 17:33:23 BST 1994
<!%%EndDate LastModified>
<hr>
</ADDRESS>


</body>
</html>   
 
   
   


 
<hr>
<h6>Internet URL-
 <a href= http://info.uminho.pt:80/x500particip.html>http://info.uminho.pt:80/x500particip.html </a> </h6>
